Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/insurance/private_health_insurance.html.txt.tmx
Source language: en
Languages: ga

source: A number of companies offer voluntary private health insurance in Ireland
ga: Tairgeann roinnt comhlachtaí in Éirinn árachas sláinte príobháideach deonach

source: • GloHealth was taken over by Irish Life Health in 2016
ga: Is é an Bord Árachais Sláinte Dheonaigh (VHI) an soláthraí is mó árachais sláinte dheonaigh phríobháidigh

source: GloHealth customers will be invited to join Irish Life Health as their policies come up for renewal
ga: Comhlacht reachtúil is ea é a ndéanann an tAire Sláinte a bhord a cheapadh

source: • HSF Health Plan (provides cash benefit plans but not in-patient health insurance) • Irish Life Health (formerly Aviva Health) • Laya Healthcare • VHI Healthcare
ga: Oibríonn Laya Healthcare, QUINN-healthcare roimhe seo, Aviva, GloHealth agus HSF Health Plan (níl aon chumhdach costais ospidéil d'othair chónaitheach) mar sholáthraí árachais sláinte dheonaigh phríobháidigh in Éirinn freisin

source: There are a number of long-established health insurance providers that deal only with particular groups of employees; membership is confined to employees and retired employees and their dependants
ga: Tá roinnt soláthraithe árachais sláinte seanbhunaithe ann a dheailáileann le grúpaí áirithe fostaithe – ní féidir ach le fostaithe agus fostaithe ar scor agus a gcleithiúnaithe a bheith ina mbaill dóibh

source: These schemes are known as restricted membership schemes. Examples include the Gardaí, prison officers and ESB employees
ga: Cuirtear scéimeanna le ballraíocht theoranta ar na scéimeanna seo – áirítear mar shamplaí na scéimeanna do na Gardaí, do oifigigh phríosúin agus do fhostaithe an BSE

source: The rules governing health insurance apply equally to all providers with some limited exceptions for the restricted membership schemes
ga: Baineann na rialacha i dtaca le hárachas sláinte go cothrom leis na soláthraithe uile, ach déantar roinnt eisceachtaí i gcás na scéimeanna le ballraíocht theoranta

source: Health insurance is used to pay for private care in hospital or from various health professionals in hospitals or in their practices
ga: Úsáidtear árachas sláinte chun íoc as cúram príobháideach ospidéil nó cúram ó ghairmithe éagsúla sláinte san hospidéil nó ina gcuid cleachtas féin

source: The arrangements vary from one company to another but most companies have agreements with hospitals that the company will pay the hospital directly
ga: Tá socruithe éagsúla ann ó chomhlacht go céile, ach tá socruithe ag an gcuid is mó de na comhlachtaí a ligeann don chomhlacht an ospidéal a íoc go díreach

source: In general, for outpatient costs you pay the health professional and then claim from the health insurance company
ga: De ghnáth íocann tú an gairmí sláinte agus ansin cuireann tú éileamh isteach ar an gcomhlacht sláinte árachais

source: You should check with your own company as to exactly what procedures they use
ga: Ba chóir duit fáil amach ó do chomhlacht féin cén nósanna imeachta atá acu

source: The Health Insurance Authority (HIA) is the independent statutory regulator for the private health insurance market in Ireland
ga: Rialóir neamhspleách reachtúil do mhargadh an árachais phríobháidigh sláinte in Éirinn é an tÚdarás um Árachas Sláinte (ÚÁS)

source: It monitors the operation of health insurance business in Ireland and advises the Minister for Health in this regard, including assessing the effect of any regulations or new legislation on consumers
ga: Déanann sé monatóireacht ar oibriú an ghnó um árachas sláinte in Éirinn agus cuireann sé comhairle ar an Aire Sláinte ina thaobh, san áireamh déanann sé measúnú ar an tionchar atá ag aon rialacháin nó reachtaíocht nua ar thomhaltóirí

source: The HIA aims to ensure that consumers are aware of their rights and that policies and publicity material describe cover in a fair and comparable way
ga: Tá sé mar aidhm ag an Údarás déanamh cinnte go bhfuil tomhaltóirí ar an eolas maidir lena gcearta; go bhfuil cur síos cothrom déanta ar an gclúdach i bpolasaithe agus in ábhar bolscaireachta ar bhealach gur féidir comparáid a dhéanamh idir pholasaithe

source: The Authority also reviews the appropriateness of the procedures used by insurers in their dealings with consumers
ga: Déanann an tÚdarás athbhreithniú chomh maith ar oiriúnacht na gcleachtas a mbaineann lucht árachais úsáid astu agus iad ag déileáil le tomhaltóirí

source: The Health Insurance Authority has useful publications called My Rights, My Choices and Selecting a Private Health Insurance Product. You can read them online or request a hard copy
ga: Tá tuairisc foilsithe ag an Údarás um Árachas Sláinte ar a dtugtar: Mo Chearta, mo Roghanna (pdf) agus Táirgí Árachais Phríobháidigh Sláinte a Roghnú (pdf), Is féidir iad ar líne a léamh nó iarratas ar chruacóíp a dhéanamh

source: You can also compare the benefits and prices of different health insurance products using their product comparison tool
ga: Is féidir comparáid na príomhchostais agus sochair a bhaineann le táirgí árachais sláinte difríúla a dhéanamh tríd an uirlis comparáide táirgí

source: One of the Health Insurance Authority's functions relates to the operation of a Risk Equalisation Scheme
ga: Baineann ceann de bhunfheidhmeanna an Údaráis um Árachas Sláinte le hoibriú Scéime um Chothromú Riosca

source: Risk equalisation is a process that aims to equitably neutralise differences in insurers' costs that arise due to variations in the age profile of their members
ga: Is próiseas é cothromú fiontar a fhéachann le neodrú a dhéanamh ar na difríochtaí i gcostais árachóirí a eascraíonn as athruithe i bpróifíl aoise a mball

source: This process is relevant to the customer in so far as it may affect matters such as the operation of community rating or competition between insurers
ga: Tá an próiseas sin ábhartha don chustaiméir sá mhéid go bhféadfadh sé difear a dhéanamh do chúrsaí áirithe amhail feidhmiú an phobalrátaithe agus iomaíocht idir árachóirí

source: The HIA administers a Risk Equalisation Fund which pays health credits to the insurance company for people over 60 to help to meet their higher claims costs
ga: Déanann an tÚdarás Árachas Sláinte Ciste um Chothromú Fiontar a riar, rud a íocann creidmheasanna sláinte don chuideachta árachais thar ceann daoine atá os cionn 60 bliain d’aois chun cabhrú le freastal ar a gcostais éileamh níos airde

source: The health credits vary by age, gender and by level of cover
ga: Ní ionann na creidmheasanna sláinte do gach aois, don dá inscne ná don leibhéal clúdaigh

source: These credits are funded by a community rating health insurance levy paid by health insurers
ga: Cistítear na creidmheasanna sin trí thobhach pobalrátaithe árachais sláinte a n-íocann árachóirí sláinte é

source: The Health Insurance Tax Credit reduces the amount of the health insurance premium that you pay. Rules
ga: Ní mór do gach árachóir sláinte a chlárú leis an Údarás Árachais Sláinte

source: All private health insurance providers must be registered with the Health Insurance Authority. Typically, insurers must also satisfy various prudential requirements, which are appropriate to the Central Bank of Ireland - these are requirements that apply generally to all insurance and financial services companies and relate to matters like their financial operation and their investment policies
ga: Is iondúil go mbíonn ar árachóirí riachtanais éagsúla stuamachta a shásamh, a bhaineann leis Banc Ceannais na hÉireann – baineann na riachtanais seo go ginearálta leis na comhlachtaí go léir árachais agus seirbhísí airgeadais, agus le hábhair cosúil le feidhmiú airgeadais agus polasaithe infheistíochta

source: At present, companies that are offering cover for in-patient hospital services must offer a minimum level of benefits
ga: I láthair na huaire, ní mór do chomhlachtaí a thairgeann clúdach i dtaca le seirbhísí ospidéil othar cónaitheach íosleibhéal sochar a chur ar fáil

source: They must provide a minimum level of cover in respect of:
ga: Ní mór dóibh íosleibhéal clúdaigh a thairiscint maidir le:

source: • Psychiatric treatment and substance abuse
ga: • Cóireáil shíciatrach agus mí-úsáid substaintí

source: The minimum accommodation level is semi-private in a public hospital
ga: Is é an t-íosleibhéal cóiríochta cóiríocht leathphríobháideach in ospidéal poiblí

source: Companies are allowed to offer contracts limited to certain health services, e.g., dental and optical services, without being subject to the general requirements about community rating, open enrolment and lifetime cover
ga: Tá sé de chead ag comhlachtaí conarthaí a thairiscint atá teoranta do sheirbhísí áirithe sláinte, mar shampla do sheirbhísí fiacla agus optúla, gan a bheith orthu na riachtanais ghinearálta i dtaca le rátáil phobail a shásamh, clárú oscailte agus clúdach feadh saoil

source: They may also offer contracts in relation to GP and out-patient services without having to meet minimum benefit requirements
ga: Is féidir leo chomh maith conarthaí a thairiscint maidir le seirbhísí liachleachtóir ginearálta agus othar seachtrach gan beith orthu na riachtanais ó thaobh íosleibhéal sochair

source: There are three general principles that apply to health insurance:
ga: Baineann trí phrionsabal ghinearálta le hárachas sláinte:

source: At present, health insurance companies must accept anyone who wishes to join, subject to any applicable waiting periods before cover takes effect, regardless of age, sex or health status - this is known as "open enrolment"
ga: Faoi láthair, ní mór do chomhlachtaí árachais sláinte glacadh le haon duine ar mian leo clárú, is cuma cén aois, gnéas nó stádas sláinte atá acu - cuirtear "clárú oscailte" air seo

source: Restricted membership schemes must accept everyone who is qualified to join
ga: Ní mór do scéimeanna le ballraíocht theoranta glacadh le gach duine incháilithe

source: Once you join and continue to pay your premiums, the insurance company cannot refuse to provide you with cover - this is called "lifetime cover"
ga: Nuair a chláraíonn tú agus nuair leanann tú ar aghaidh ag íoc do phréimheanna, ní féidir leis an gcomhlacht árachais gan clúdach a thabhairt duit - cuirtear "clúdach feadh saoil" air seo

source: "Community rating" means that the insurance company must charge the same rate for a given level of service, regardless of age, sex or health status
ga: Ciallaíonn "rátáil phobail" nach mór don chomhlacht árachais an ráta céanna a chur ar leibhéal áirithe seirbhísí, gan bacadh le haois, gnéas nó stádas sláinte a chur san áireamh

source: So all adults pay the same amount for the same benefits
ga: Mar sin íocann aosaigh uile an méid céanna as na sochair chéanna

source: Unlike motor insurance or life insurance, matters such as age, sex, sexual orientation, health or past record of claims do not affect the price charged for insurance
ga: Murab ionann agus árachas mótair nó árachas saoil, níl aon tionchar ag gnéas, claonadh gnéasach, sláinte nó stair éileamh ar na táillí a chaitear a íoc as árachas

source: Charges may be lower than the normal adult rate for: people aged under 25; retired people who have a special arrangement within their company's health insurance scheme and people in group health insurance schemes. Charges for children must be reduced by at least 50%
ga: Is féidir go mbeidh táillí níos lú ná na gnáth táillí d'aosaigh i gcás daoine faoi 18 mbliana, daoine idir 18 agus 23 bliana, daoine ar scor a bhfuil socrú speisialta acu le scéim árachais a gcomhlachta agus daoine i scéimeanna grúpa árachais sláinte

source: Higher charges apply to people who are 35 years of age or older when they first take out health insurance
ga: Ón 1 Bealtaine 2015, beidh táillí níos airde i bhfeidhm do dhaoine atá 35 bliain d’aois nó níos sine agus árachas sláinte á cheannach acu den chéad uair

source: There is a 2% loading for each year over 34 years of age
ga: Cuirfear lódáil 2% leis an gcostas i leith gach bliana os cionn 34 bliain d’aois

source: So, for example, if you are 35 the cost is 2% higher than for a person aged 34 but if you are 44 then the cost is 20% higher
ga: Má tá tú 44 bliain d’aois, beidh an costas a íocfaidh tú 20% níos airde ná an costas a íocfaidh duine atá 34 bliain d’aois

source: If you previously had health insurance, you can be given credit for the time you were insured, reducing the number of years to which the loading applies
ga: Ní chuirfear na lódálacha sin i bhfeidhm sa chás go bhfuil árachas sláinte agat cheana féin nuair a thagann siad i bhfeidhm

source: If you have a break in cover of less than 13 weeks this will not affect your loading
ga: Má tá briseadh de níos lú ná 13 seachtaine ann i do chlúdach, ní dhéanfar difear do do lódáil

source: If you stopped your insurance cover for periods of unemployment since 1 January 2008, up to three years of credits can be provided
ga: Má chealaigh tú do chlúdach árachais ar feadh tréimhsí fostaíochta ón 1 Eanáir 2008, beifear in ann creidmheasanna trí bliana ar a mhéad a chur ar fáil

source: If you live outside Ireland and move to Ireland, a loading will not apply if you get health insurance within nine months and continue to be insured
ga: Más rud é go mbeidh cónaí ort lasmuigh d’Éirinn an 1 Bealtaine 2015 agus go mbogfaidh tú go hÉirinn ina dhiaidh sin, ní chuirfear lódáil i bhfeidhm i do leith sa chás go gceannóidh tú árachas sláinte laistigh de naoi mí agus go gcoinneoidh tú an t-árachas sin ar bun

source: The Department of Health has published a list of frequently asked questions about lifetime community rating
ga: Tá liosta de cheisteanna coitianta faoin bpobalrátú saoil foilsithe ag an Roinn Sláinte

source: The regulations are set out in Statutory Instrument 312 of 2014 (pdf)
ga: Tá na rialacháin leagtha amach in Ionstraim Reachtúil 312 de 2014 (pdf)

source: The health insurance company may not refuse to accept you on the basis of your health status but it may restrict the cover it gives you in certain circumstances
ga: Ní fhéadfaidh an chuideachta árachas sláinte diúltú do ghlacadh leat bunaithe ar do stádas sláinte, ach féadfaidh sé srian a chur i gcúinsí áirithe leis an gclúdach a chuirfidh sí ar fáil duit

source: If you are changing to a health insurance plan with improved benefits there may be a waiting period before the higher benefits apply
ga: Tá árachóirí i dteideal tréimhse feithimh thosaigh a chur i bhfeidhm sula dtiocfaidh árachas sláinte príobháideach i bhfeidhm:

source: The HIA lists the current waiting periods that are applied by insurers
ga: Tréimhse feithimh sula dtiocfaidh clúdach árachais sláintephríobháidigh i bhfeidhm

source: Insurers are entitled to apply an initial waiting period before private health insurance cover becomes effective
ga: Beidh ar bhaill de Ghnóthas Ballraíochta Teoranta (seachas BSL) tréimhsí feithimh d’iontrálaithe nua a chur isteach agus iad ag aistriú chuig Gnóthas Ballraíochta Oscailte, ar nós VHI, Aviva, Laya nó GloHealth

source: The maximum initial waiting period is 26 weeks
ga: I gcás polasaithe a fhaightear ón 1 Bealtaine 2015, is é a bheidh sa tréimhse uasta tosaigh feithimh ná 26 seachtain do gach aoisghrúpa

source: For maternity-related claims the waiting period is 52 weeks
ga: I gcás éilimh a bhaineann le máithreachas, fanfaidh an tréimhse feithimh amhail 52 seachtain

source: The health insurance company may refuse to cover you in respect of pre-existing conditions for longer periods after you join
ga: Ina theannta sin, féadfaidh an chuideachta árachais sláinte diúltú do chlúdach i ndáil le riochtaí atá ort cheana féin a chur ar fáil duit ar feadh tréimhsí níos faide tar éis duit clárú leo

source: So, for example, if you are have diabetes, the insurance company may refuse to provide you with any cover for diabetes for a specified period but must cover you for any other illnesses once the initial waiting period has expired
ga: Mar shampla, má tá diaibéiteas ort, féadfaidh an chuideachta árachais diúltú d’aon chlúdach do dhiaibéiteas a chur ar fáil duit ar feadh tréimhse shonraithe, ach ní mór di tú a chlúdach d’aon chineálacha eile tinnis chomh luath agus a bheidh an tréimhse feithimh thosaigh éagtha

source: For policies taken out since 1 May 2015, the maximum waiting period for pre-existing conditions is 5 years
ga: Amanna feithimh do dhaoine a bhfuil riochtaí leighis orthu cheana féin

source: Any waiting period for a pre-existing condition may switch from one Irish insurer to another. If the switch takes place within 13 weeks, the completed waiting periods will not have to be served again
ga: Féadfar aon tréimhse feithimh i gcomhair reachta atá ann cheana féin a aistriú ó árachóir Éireannach amháin go hárachóir Éireannach eile; má dhéantar an t-aistriú laistigh de 13 seachtaine, ní bheidh ar an árachaí na tréimhsí feithimh críochnaithe a chur isteach arís

source: For contracts taken out before 1 May 2015, longer waiting periods for pre-existing conditions could be applied to people aged 55–59 (maximum 7 years) or aged over 60 (a maximum of 10 years)
ga: I gcás polasaithe a fhaightear ón 1 Bealtaine 2015, is é a bheidh sa tréimhse uasta tosaigh feithimh i gcás coinníollacha réamhreatha ná 5 bliana do gach aoisghrúpa

source: If you are switching health insurance plans, a maximum waiting period may be applied to any higher benefit on the new plan
ga: Má tá pleananna árachas sláinte á n-aistriú agat, féadtar na tréimhsí uasta a leanas a chur i bhfeidhm ar aon sochar níos airde ar an bplean nua:

source: For contracts taken out since 1 May 2015, the maximum waiting period is 2 years (for contracts before that date a longer waiting period of 5 years could be applied to people aged over 65)
ga: I gcás polasaithe a fhaightear ón 1 Bealtaine 2015, is é a bheidh sa tréimhse uasta feithimh i gcás sochair uasghrádaithe ná 2 bhliain do gach aoisghrúpa

source: You must apply directly to the health insurance company that you wish to join
ga: Ní mór duit iarratas a chur isteach go díreach chuig an gcomhlacht árachais ar mian leat clárú ann

source: Each company must abide by the general rules described but, after that, they are free to make their own rules
ga: Caithfidh gach comhlacht glacadh leis na rialacha ginearálta luaite ach i ndiaidh sin is féidir leo a rialacha féin a cheapadh

source: The level of cover available and the rates charged vary from one company to another
ga: Tá leibhéil éagsúla ar fáil agus tá rátaí éagsúla íocaíochta ag na comhlachtaí éagsúla

source: Health insurance policies are usually 12 month contracts
ga: Is gnách gur conarthaí 12 mhí iad polasaithe árachas sláinte

source: If you want to switch insurer or insurance plan, you may do so at your next renewal date
ga: Más mian leat d’árachóir nó do phlean árachais a aistriú, féadfaidh tú amhlaidh a dhéanamh ag do chéad dáta athnuachana eile

source: Insurers may have restrictions on switching plan during the 12 month term
ga: D’fhéadfadh go bhfuil srianta ag árachóirí ar phlean a aistriú le linn an téarma 12 mhí

source: It is a general principle in insurance that you must give all relevant information to the insurance company
ga: Prionsabal ginearálta é i gcúrsaí árachais go bhfuil ort do shonraí ábhartha ar fad a thabhairt don chomhlacht árachais

source: If you do not, then the entire contract may be void
ga: Mura ndéanann tú sin, d'fhéadfadh an conradh iomlám a chur ar neamhní

source: If you are experiencing problems with getting cover, you should contact the Department of Health or the Health Insurance Authority
ga: Má tá fadhbanna agat ag fáil clúdaigh, ba chóir duit a dhul i dteagmháil leis an Roinn Sláinte nó leis an Údarás Árachais Sláinte
